In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Store CSV into DataFrame

In [3]:
csv_file = "IMDb_movies.csv"
IMDb_data_df = pd.read_csv(csv_file)
IMDb_data_df.head()

/Users/amusaadebayo/opt/anaconda3/envs/bootcamp/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$2250.00,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$45000.00,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

In [4]:
#Create new data with select columns
new_IMDb_data_df = IMDb_data_df[['title', 'year', 'genre', 'duration', 'language', 'country', 'avg_vote', 'reviews_from_users']].copy()
new_IMDb_data_df.head()

,title,year,genre,duration,language,country,avg_vote,reviews_from_users
0,Miss Jerry,1894,Romance,45,None,USA,5.9,1.0
1,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",70,None,Australia,6.1,7.0
2,Den sorte drøm,1911,Drama,53,NaN,"Germany, Denmark",5.8,5.0
3,Cleopatra,1912,"Drama, History",100,English,USA,5.2,25.0
4,L'Inferno,1911,"Adventure, Drama, Fantasy",68,Italian,Italy,7.0,31.0

In [5]:
csv_file = "MoviesOnStreaming.csv"
MoviesOnStreaming_data_df = pd.read_csv(csv_file)
MoviesOnStreaming_data_df .head()

,Unnamed: 0,ID,Title,Year,Age,IMDb,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Type,Directors,Genres,Country,Language,Runtime
0,0,1,Inception,2010,13,8.8,87%,1,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0
1,1,2,The Matrix,1999,18,8.7,87%,1,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0
2,2,3,Avengers: Infinity War,2018,13,8.5,84%,1,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0
3,3,4,Back to the Future,1985,7,8.5,96%,1,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0
4,4,5,"The Good, the Bad and the Ugly",1966,18,8.8,97%,1,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0

In [6]:
new_IMoviesOnStreaming_data_df = MoviesOnStreaming_data_df[['Title', 'Year', 'Genres', 'Runtime', 'Language', 'Country']].copy()
new_IMoviesOnStreaming_data_df.head()

,Title,Year,Genres,Runtime,Language,Country
0,Inception,2010,"Action,Adventure,Sci-Fi,Thriller",148.0,"English,Japanese,French","United States,United Kingdom"
1,The Matrix,1999,"Action,Sci-Fi",136.0,English,United States
2,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",149.0,English,United States
3,Back to the Future,1985,"Adventure,Comedy,Sci-Fi",116.0,English,United States
4,"The Good, the Bad and the Ugly",1966,Western,161.0,Italian,"Italy,Spain,West Germany"

In [7]:
#Create new data with select columns
#new_customer_data_df = customer_data_df[['id', 'first_name', 'last_name']].copy()
#new_customer_data_df.head()

In [8]:
# Store JSON data into a DataFrame
# json_file = "IMDb_movies".json
# IMDb_movies_df = pd.read_json(json_file)
# IMDb_movies.head()

# json = new_IMDb_data_df.to_json()
# print(json)

In [9]:
#Clean DataFrame
# new_customer_location_df = customer_location_df[["id", "address", "us_state"]].copy()
# new_customer_location_df.head()

In [10]:
from getpass import getpass
password = getpass("Password")

In [12]:
#password

In [13]:
# Connect to local database
rds_connection_string = f"postgres:{password}@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [14]:
#Check for tables

In [15]:

engine.table_names()

['NewIMDB', 'IMovies']

In [16]:
# Use pandas to load csv converted DataFrame into database
new_IMDb_data_df.to_sql(name='NewIMDB', con=engine, if_exists='append', index=False)

In [17]:
new_IMoviesOnStreaming_data_df.to_sql(name='IMovies', con=engine, if_exists='append', index=False)

In [ ]:


# # Confirm data has been added by querying the customer_name table
# NOTE: can also check using pgAdmin

In [18]:
pd.read_sql_query('select * from Public."IMovies" ', con=engine).head()

,Title,Year,Genres,Runtime,Language,Country
0,Inception,2010,"Action,Adventure,Sci-Fi,Thriller",148.0,"English,Japanese,French","United States,United Kingdom"
1,The Matrix,1999,"Action,Sci-Fi",136.0,English,United States
2,Avengers: Infinity War,2018,"Action,Adventure,Sci-Fi",149.0,English,United States
3,Back to the Future,1985,"Adventure,Comedy,Sci-Fi",116.0,English,United States
4,"The Good, the Bad and the Ugly",1966,Western,161.0,Italian,"Italy,Spain,West Germany"

In [32]:
# Confirm data has been added by querying the customer_location table
pd.read_sql_query('select * from Public."NewIMDB"', con=engine).head()

,title,year,genre,duration,language,country,avg_vote,reviews_from_users
0,Miss Jerry,1894,Romance,45,None,USA,5.9,1.0
1,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",70,None,Australia,6.1,7.0
2,Den sorte drøm,1911,Drama,53,None,"Germany, Denmark",5.8,5.0
3,Cleopatra,1912,"Drama, History",100,English,USA,5.2,25.0
4,L'Inferno,1911,"Adventure, Drama, Fantasy",68,Italian,Italy,7.0,31.0